src/Documents/КАЗ_ВнутреннееПеремещениеДенежныхСредств/КАЗ_ВнутреннееПеремещениеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КАЗ_ВнутреннееПеремещениеДенежныхСредств</name>
  <registerRecords>AccumulationRegister.КАЗ_ОстаткиСчетовИКасс</registerRecords>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.КАЗ_БанковскиеСчетаОрганизации</types>
      <types>CatalogRef.КАЗ_КассыОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Приемник</name>
    <type>
      <types>CatalogRef.КАЗ_БанковскиеСчетаОрганизации</types>
      <types>CatalogRef.КАЗ_КассыОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/КАЗ_ОстаткиСчетовИКасс/КАЗ_ОстаткиСчетовИКасс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КАЗ_ОстаткиСчетовИКасс</name>
  <registerType>Balance</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СчетКасса</name>
    <type>
      <types>CatalogRef.КАЗ_БанковскиеСчетаОрганизации</types>
      <types>CatalogRef.КАЗ_КассыОрганизации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/КАЗ_ВнутреннееПеремещениеДенежныхСредств/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Не ЗначениеЗаполнено(Источник) Тогда
		Сообщить("Не указан источник перемещения.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Приемник) Тогда
		Сообщить("Не указан приемник перемещения.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Источник = Приемник Тогда
		Сообщить("Источник и приемник перемещения совпадают.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Сумма <= 0 Тогда
		Сообщить("Сумма перемещения должна быть больше нуля.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ЗапросОстатка = Новый Запрос;
	ЗапросОстатка.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК Остаток
	|ИЗ
	|	РегистрНакопления.КАЗ_ОстаткиСчетовИКасс.Остатки(&Дата, СчетКасса = &СчетКасса) КАК Остатки";
	ЗапросОстатка.УстановитьПараметр("Дата", Дата);
	ЗапросОстатка.УстановитьПараметр("СчетКасса", Источник);
	РезультатОстатка = ЗапросОстатка.Выполнить().Выбрать();
	ТекущийОстаток = 0;
	Если РезультатОстатка.Следующий() Тогда
		ТекущийОстаток = РезультатОстатка.Остаток;
	КонецЕсли;

	Если ТекущийОстаток < Сумма Тогда
		Сообщить("Недостаточно средств на источнике. Остаток: " + Формат(ТекущийОстаток, "ЧДЦ=2"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.КАЗ_ОстаткиСчетовИКасс.Записывать = Истина;

	ДвижениеРасход = Движения.КАЗ_ОстаткиСчетовИКасс.Добавить();
	ДвижениеРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
	ДвижениеРасход.Период = Дата;
	ДвижениеРасход.СчетКасса = Источник;
	ДвижениеРасход.Сумма = Сумма;

	ДвижениеПриход = Движения.КАЗ_ОстаткиСчетовИКасс.Добавить();
	ДвижениеПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеПриход.Период = Дата;
	ДвижениеПриход.СчетКасса = Приемник;
	ДвижениеПриход.Сумма = Сумма;

КонецПроцедуры
